app/Http/Controllers/ProjectController.php

update "projects" set "title" = 'First Project３３', "updated_at" = '2018-11-22 15:11:18' where "id" = '1'
---
    public function edit(Request $request, Project $project)
    {
        $project->title = $request->title;
        $project->update();