app/Http/Controllers/TaskController.php

select * from "projects" where "projects"."user_id" = 1 and "projects"."user_id" is not null
select * from "tasks" where "tasks"."project_id" = 1 and "tasks"."project_id" is not null and "done" = 0 order by "created_at" desc limit 20 offset 0
select count(*) as aggregate from "tasks" where "tasks"."project_id" = 1 and "tasks"."project_id" is not null and "done" = 0
---
    public function index(Request $request)
    {
        if (Auth::check()) {
            $user = Auth::user();
            if ($user->current_project_id == null) {
                // まだプロジェクトを持っていないユーザーの対応
                $tasks = Task::where('user_id', $user->id)
                    ->orderBy('created_at', 'desc')
                    ->paginate(20);
                return view('task.index', [
                    'tasks' => $tasks,
                ]);
            } else {
                // プロジェクトマイグレーション済みのユーザー
                $projects = $user->projects;
                $project = $projects->where('id', $user->current_project_id)->first();
                $tasks = $project->tasks()
                    ->where('done', false)
                    ->orderBy('created_at', 'desc')
                    ->paginate(20);

update "users" set "updated_at" = '2018-11-22 15:12:10', "current_project_id" = 1 where "id" = '1'
---
    public function change(Request $request, Project $project)
    {
        // プロジェクトIdの更新
        $user = Auth::user();
        $projects = $user->projects;
        $user->current_project_id = $project->id;
        $user->update();